app/views/songs/index.html.erb

SELECT "songs".* FROM "songs"
---
<table class="table">
<% @songs = Song.all %>