app/views/songs/new.html.erb

    <%= form.label :artist %>
    <%= form.collection_select :artist, Artist.order(:name), :id, :name, { include_blank: true }, { class: "form-control" } %>
---
SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" ASC