app/controllers/surveys_controller.rb

  def show
    @survey = Survey.find_by(id: params["id"])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 57]]