app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("rating", "song_id", "user_id") VALUES (?, ?, ?)  [["rating", "Good"], ["song_id", 97], ["user_id", 14]]
---
  def create
    survey_params = params.require(:survey).permit(:rating)
    @survey = @song.surveys.new(survey_params)
    @survey.user = current_user
    if @survey.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 92]]
---
  def find_song
    @song = Song.find_by(id: params["song_id"])